USE sinema
GO

INSERT INTO Il VALUES
	('Ýstanbul'),
	('Trabzon'),
	('Yalova'),
	('Bursa'),
	('Sakarya'),
	('Ankara'),
	('Konya'),
	('Rize'),
	('Antalya'),
	('Diyarbakýr')
GO

INSERT INTO Ilce VALUES
	('Bahçelievler',1),
	('Of',2),
	('Merkez',3),
	('Mudanya',4),
	('Merkez',5),
	('Kýzýlay',6),
	('Merkez',7),
	('Merkez',8),
	('Merkez',9),
	('Merkez',10)
GO

INSERT INTO Sinema VALUES
	('sinema istanbul',3,'1998',1,1),
	('sinema trabzon',2,'1998',2,2),
	('sinema yalova',1,'1998',3,3),
	('sinema bursa',1,'1998',4,4),
	('sinema sakarya',1,'1998',5,5),
	('sinema ankara',1,'1998',6,6),
	('sinema konya',1,'1998',7,7),
	('sinema rize',1,'1998',8,8),
	('sinema antalya',1,'1998',9,9),
	('sinema diyarbakýr',1,'1998',10,10)
GO

INSERT INTO SinemaSalonu VALUES
	(40,1),(40,1),(40,1),	-- SÝNEMA ÝSTANBUL
	(40,2),(40,2),			-- SÝNEMA TRABZON
	(40,3),					-- SÝNEMA YALOVA
	(40,4),					-- SÝNEMA BURSA
	(40,5),					-- SÝNEMA SAKARYA
	(40,6),					-- SÝNEMA ANKARA
	(40,7),					-- SÝNEMA KONYA
	(40,8),					-- SÝNEMA RÝZE
	(40,9),					-- SÝNEMA ANTALYA
	(40,10)					-- SÝNEMA DÝYARBAKIR
GO

INSERT INTO Koltuk VALUES
	(1,1,1),(1,2,1),(1,3,1),(1,4,1),(1,5,1),(1,6,1),(1,7,1),(1,8,1),			--SALON1 SÝNEMA ÝSTANBUL
	(2,1,1),(2,2,1),(2,3,1),(2,4,1),(2,5,1),(2,6,1),(2,7,1),(2,8,1),
	(3,1,1),(3,2,1),(3,3,1),(3,4,1),(3,5,1),(3,6,1),(3,7,1),(3,8,1),
	(4,1,1),(4,2,1),(4,3,1),(4,4,1),(4,5,1),(4,6,1),(4,7,1),(4,8,1),
	(5,1,1),(5,2,1),(5,3,1),(5,4,1),(5,5,1),(5,6,1),(5,7,1),(5,8,1),

	(1,1,2),(1,2,2),(1,3,2),(1,4,2),(1,5,2),(1,6,2),(1,7,2),(1,8,2),			--SALON2 SÝNEMA ÝSTANBUL
	(2,1,2),(2,2,2),(2,3,2),(2,4,2),(2,5,2),(2,6,2),(2,7,2),(2,8,2),
	(3,1,2),(3,2,2),(3,3,2),(3,4,2),(3,5,2),(3,6,2),(3,7,2),(3,8,2),
	(4,1,2),(4,2,2),(4,3,2),(4,4,2),(4,5,2),(4,6,2),(4,7,2),(4,8,2),
	(5,1,2),(5,2,2),(5,3,2),(5,4,2),(5,5,2),(5,6,2),(5,7,2),(5,8,2),

	(1,1,3),(1,2,3),(1,3,3),(1,4,3),(1,5,3),(1,6,3),(1,7,3),(1,8,3),			--SALON3 SÝNEMA ÝSTANBUL
	(2,1,3),(2,2,3),(2,3,3),(2,4,3),(2,5,3),(2,6,3),(2,7,3),(2,8,3),
	(3,1,3),(3,2,3),(3,3,3),(3,4,3),(3,5,3),(3,6,3),(3,7,3),(3,8,3),
	(4,1,3),(4,2,3),(4,3,3),(4,4,3),(4,5,3),(4,6,3),(4,7,3),(4,8,3),
	(5,1,3),(5,2,3),(5,3,3),(5,4,3),(5,5,3),(5,6,3),(5,7,3),(5,8,3),

	(1,1,4),(1,2,4),(1,3,4),(1,4,4),(1,5,4),(1,6,4),(1,7,4),(1,8,4),			--SALON4 SÝNEMA TRABZON
	(2,1,4),(2,2,4),(2,3,4),(2,4,4),(2,5,4),(2,6,4),(2,7,4),(2,8,4),
	(3,1,4),(3,2,4),(3,3,4),(3,4,4),(3,5,4),(3,6,4),(3,7,4),(3,8,4),
	(4,1,4),(4,2,4),(4,3,4),(4,4,4),(4,5,4),(4,6,4),(4,7,4),(4,8,4),
	(5,1,4),(5,2,4),(5,3,4),(5,4,4),(5,5,4),(5,6,4),(5,7,4),(5,8,4),

	(1,1,5),(1,2,5),(1,3,5),(1,4,5),(1,5,5),(1,6,5),(1,7,5),(1,8,5),			--SALON5 SÝNEMA TRABZON
	(2,1,5),(2,2,5),(2,3,5),(2,4,5),(2,5,5),(2,6,5),(2,7,5),(2,8,5),
	(3,1,5),(3,2,5),(3,3,5),(3,4,5),(3,5,5),(3,6,5),(3,7,5),(3,8,5),
	(4,1,5),(4,2,5),(4,3,5),(4,4,5),(4,5,5),(4,6,5),(4,7,5),(4,8,5),
	(5,1,5),(5,2,5),(5,3,5),(5,4,5),(5,5,5),(5,6,5),(5,7,5),(5,8,5),

	(1,1,6),(1,2,6),(1,3,6),(1,4,6),(1,5,6),(1,6,6),(1,7,6),(1,8,6),			--SALON6 SÝNEMA YALOVA
	(2,1,6),(2,2,6),(2,3,6),(2,4,6),(2,5,6),(2,6,6),(2,7,6),(2,8,6),
	(3,1,6),(3,2,6),(3,3,6),(3,4,6),(3,5,6),(3,6,6),(3,7,6),(3,8,6),
	(4,1,6),(4,2,6),(4,3,6),(4,4,6),(4,5,6),(4,6,6),(4,7,6),(4,8,6),
	(5,1,6),(5,2,6),(5,3,6),(5,4,6),(5,5,6),(5,6,6),(5,7,6),(5,8,6),

	(1,1,7),(1,2,7),(1,3,7),(1,4,7),(1,5,7),(1,6,7),(1,7,7),(1,8,7),			--SALON7 SÝNEMA BURSA 
	(2,1,7),(2,2,7),(2,3,7),(2,4,7),(2,5,7),(2,6,7),(2,7,7),(2,8,7),
	(3,1,7),(3,2,7),(3,3,7),(3,4,7),(3,5,7),(3,6,7),(3,7,7),(3,8,7),
	(4,1,7),(4,2,7),(4,3,7),(4,4,7),(4,5,7),(4,6,7),(4,7,7),(4,8,7),
	(5,1,7),(5,2,7),(5,3,7),(5,4,7),(5,5,7),(5,6,7),(5,7,7),(5,8,7),

	(1,1,8),(1,2,8),(1,3,8),(1,4,8),(1,5,8),(1,6,8),(1,7,8),(1,8,8),			--SALON8 SÝNEMA SAKARYA
	(2,1,8),(2,2,8),(2,3,8),(2,4,8),(2,5,8),(2,6,8),(2,7,8),(2,8,8),
	(3,1,8),(3,2,8),(3,3,8),(3,4,8),(3,5,8),(3,6,8),(3,7,8),(3,8,8),
	(4,1,8),(4,2,8),(4,3,8),(4,4,8),(4,5,8),(4,6,8),(4,7,8),(4,8,8),
	(5,1,8),(5,2,8),(5,3,8),(5,4,8),(5,5,8),(5,6,8),(5,7,8),(5,8,8),

	(1,1,9),(1,2,9),(1,3,9),(1,4,9),(1,5,9),(1,6,9),(1,7,9),(1,8,9),			--SALON9 SÝNEMA ANKARA
	(2,1,9),(2,2,9),(2,3,9),(2,4,9),(2,5,9),(2,6,9),(2,7,9),(2,8,9),
	(3,1,9),(3,2,9),(3,3,9),(3,4,9),(3,5,9),(3,6,9),(3,7,9),(3,8,9),
	(4,1,9),(4,2,9),(4,3,9),(4,4,9),(4,5,9),(4,6,9),(4,7,9),(4,8,9),
	(5,1,9),(5,2,9),(5,3,9),(5,4,9),(5,5,9),(5,6,9),(5,7,9),(5,8,9),

	(1,1,10),(1,2,10),(1,3,10),(1,4,10),(1,5,10),(1,6,10),(1,7,10),(1,8,10),	--SALON10 SÝNEMA KONYA
	(2,1,10),(2,2,10),(2,3,10),(2,4,10),(2,5,10),(2,6,10),(2,7,10),(2,8,10),
	(3,1,10),(3,2,10),(3,3,10),(3,4,10),(3,5,10),(3,6,10),(3,7,10),(3,8,10),
	(4,1,10),(4,2,10),(4,3,10),(4,4,10),(4,5,10),(4,6,10),(4,7,10),(4,8,10),
	(5,1,10),(5,2,10),(5,3,10),(5,4,10),(5,5,10),(5,6,10),(5,7,10),(5,8,10),

	(1,1,11),(1,2,11),(1,3,11),(1,4,11),(1,5,11),(1,6,11),(1,7,11),(1,8,11),	--SALON11 SÝNEMA RÝZE
	(2,1,11),(2,2,11),(2,3,11),(2,4,11),(2,5,11),(2,6,11),(2,7,11),(2,8,11),
	(3,1,11),(3,2,11),(3,3,11),(3,4,11),(3,5,11),(3,6,11),(3,7,11),(3,8,11),
	(4,1,11),(4,2,11),(4,3,11),(4,4,11),(4,5,11),(4,6,11),(4,7,11),(4,8,11),
	(5,1,11),(5,2,11),(5,3,11),(5,4,11),(5,5,11),(5,6,11),(5,7,11),(5,8,11),

	(1,1,12),(1,2,12),(1,3,12),(1,4,12),(1,5,12),(1,6,12),(1,7,12),(1,8,12),	--SALON12 SÝNEMA ANTALYA
	(2,1,12),(2,2,12),(2,3,12),(2,4,12),(2,5,12),(2,6,12),(2,7,12),(2,8,12),
	(3,1,12),(3,2,12),(3,3,12),(3,4,12),(3,5,12),(3,6,12),(3,7,12),(3,8,12),
	(4,1,12),(4,2,12),(4,3,12),(4,4,12),(4,5,12),(4,6,12),(4,7,12),(4,8,12),
	(5,1,12),(5,2,12),(5,3,12),(5,4,12),(5,5,12),(5,6,12),(5,7,12),(5,8,12),

	(1,1,13),(1,2,13),(1,3,13),(1,4,13),(1,5,13),(1,6,13),(1,7,13),(1,8,13),	--SALON13 SÝNEMA DÝYARBAKIR
	(2,1,13),(2,2,13),(2,3,13),(2,4,13),(2,5,13),(2,6,13),(2,7,13),(2,8,13),
	(3,1,13),(3,2,13),(3,3,13),(3,4,13),(3,5,13),(3,6,13),(3,7,13),(3,8,13),
	(4,1,13),(4,2,13),(4,3,13),(4,4,13),(4,5,13),(4,6,13),(4,7,13),(4,8,13),
	(5,1,13),(5,2,13),(5,3,13),(5,4,13),(5,5,13),(5,6,13),(5,7,13),(5,8,13)
GO

INSERT INTO Film VALUES
	('Spider-Man: No Way Home','8.4','148',200000000,'Spider-Man in kimliðinin ortaya çýkmasýyla Peter, Doctor Strange den yardým ister. Bir büyü ters gittiðinde, diðer dünyalardan tehlikeli düþmanlar ortaya çýkmaya baþlar.','2021'),
	('Father Stu','7.1','124',110000000,'Kendi kendini yok etmekten kurtuluþa uzanan yolculuðunda sayýsýz insana ilham veren, boksöre dönüþmüþ bir rahip olan Peder Stuart Long un hayatýný takip ediyor.','2022'),
	('Uncharted','6.6','116',120000000,'Nathan Drake, deneyimli hazine avcýsý Victor Sullivan tarafýndan Ferdinand Magellan ýn biriktirdiði ve 500 yýl önce Moncada Hanedaný tarafýndan kaybedilen bir serveti geri almak için iþe alýnýr.','2022'),
	('No Time to Die','7.3','163',250000000,'James Bond aktif hizmetten ayrýldý. CIA den eski bir arkadaþ olan Felix Leiter in ortaya çýkýp yardým istemesiyle huzuru kýsa sürer.','2021'),
	('Don`t Look Up','7.2','138',75000000,'Ýki düþük seviyeli gökbilimci, insanlýðý Dünya gezegenini yok edecek yaklaþan bir kuyruklu yýldýz konusunda uyarmak için dev bir medya turuna çýkmak zorundadýr.','2021'),
	('The Northman','7.9','136',90000000,'Vizyon sahibi yönetmen Robert Eggers tan, genç bir Viking prensinin babasýnýn cinayetinin intikamýný alma arayýþýný konu alan aksiyon dolu destansý The Northman geliyor.','2022'),
	('The Adam Project','6.7','106',116000000,'2022 de kazayla iniþ yaptýktan sonra, zaman yolculuðu yapan savaþ pilotu Adam Reed, geleceði kurtarma görevi için 12 yaþýndaki benliðiyle bir araya gelir.','2022'),
	('The Matrix Resurrections','5.7','148',190000000,'Ýki gerçekliðin dünyasýna geri dönün: biri, günlük yaþam; diðeri, arkasýnda ne yatýyor.','2021'),
	('Infinite Storm','5.2','101',100000000,'Bir daðcý bir kar fýrtýnasýna yakalandýðýnda, mahsur kalan bir yabancýyla karþýlaþýr ve akþam olmadan ikisini de daðdan aþaðý indirmesi gerekir.','2022'),
	('Windfall','5.7','102',90000000,'Bir adam bir teknoloji milyarderinin boþ tatil evine girer, ancak kibirli patron ve karýsý son dakika kaçamaðý için geldiklerinde iþler ters gider.','2022')
GO

INSERT INTO FilmKategori VALUES
	('Bilim Kurgu'),
	('Aksiyon'),
	('Komedi'),
	('Korku'),
	('Biyografik'),
	('Fantastik'),
	('Drama'),
	('Belgesel'),
	('Gerilim'),
	('Macera')
GO

INSERT INTO HangiFilmHangiKategori VALUES
	(1,6),(1,10),(1,2),
	(2,5),(2,7),
	(3,10),(3,2),
	(4,9),(4,2),
	(5,3),
	(6,2),(6,9),
	(7,1),(7,3),(7,10),
	(8,1),(8,2),
	(9,1),(9,9),(9,2),
	(10,9),(10,7)
GO

INSERT INTO Gorev VALUES
	('Baþrol'),
	('Oyuncu'),
	('Yönetmen'),
	('Ses Yönetmeni'),
	('Senarist'),
	('Yardýmcý Yönetmen'),
	('Yapýmcý'),
	('Iþýk Þefi'),
	('Sanat Yönetmeni'),
	('Asistan')
GO

INSERT INTO Ekip VALUES
	('Jon','Watts','1981-06-28','E'),						-- SPÝDER-MAN YÖNETMEN
	('Chris','McKenna','1993-07-30' ,'E'),					-- SPÝDER-MAN SENARÝST
	('Tom','Holland','1996-06-01','E'),
	('Zendaya Maree','Coleman','1996-09-01','K'),
	('William','Dafoe','1955-07-22','E'),
	('Benedict','Cumberbatch','1976-07-19','E'),
	('Rosalind','Ross','1990-07-05','K'),					-- FATHER STU YÖNETMEN VE SENARÝST
	('Mark Robert Michael','Wahlberg','1971-06-05','E'),
	('Mell','Gibson','1956-01-03','E'),
	('Teresa','Ruiz','1988-12-21','K'),
	('Ruben','Fleischer','1974-10-31','E'),					-- UNCHARTED YÖNETMEN
	('Rafe','Judkins','1983-01-08','E'),					-- UNCHARTED SENARÝST
	('Sophia Taylor','Ali','1995-11-07','K'),
	('Cary Joji','Fukunaga','1977-07-10','E'),				-- BOND YÖNETMEN
	('Neal','Purvis','1961-09-09','E'),						-- BOND SENARÝST
	('Daniel','Craig','1968-02-03','E'),
	('Léa','Seydoux','1987-07-01','K'),
	('Rami','Malek','1981-05-12','E'),
	('Adam','McKay','1968-04-17','E'),						-- DONT LOOK YÖNETMEN VE SENARÝST
	('Leonardo','DiCaprio','1974-11-11','E'),
	('Jennifer','Lawrence','1990-08-15','K'),
	('Meryl','Streep','1949-06-02','K'),
	('Robert','Eggers','1983-03-08','E'),					--THE NORTHMAN YÖNETMEN VE SENARÝST
	('Alexander','Skarsgård','1976-08-25','E'),
	('Claes','Bang','1967-04-28','E'),
	('Nicole','Kidman','1967-06-20','K'),
	('Shawn','Levy','1968-07-23','E'),						-- ADAM PROJECT YÖNETMEN
	('Mark','Levin','1968-08-20','E'),						-- ADAM PROJECT SENARÝST
	('Ryan','Reynolds','1976-10-23','E'),
	('Mark','Ruffalo','1967-11-22','E'),
	('Jennifer','Garner','1972-04-17','K'),
	('Lana','Wachowski','1965-06-21','K'),					-- MATRÝX YÖNETMEN VE SENARÝST
	('Keanu','Reeves','1964-09-02','E'),
	('Carrie-Anne','Moss','1967-08-21','K'),
	('Yahya Abdul-Mateen','II','1986-07-15','E'),
	('Malgorzata','Szumowska','1973-02-26','K'),			-- ÝNFÝNÝTE STROM YÖNETMEN
	('Joshua','Rollins','1971-01-21','E'),					-- ÝNFÝNÝTE STROM SENARÝST
	('Naomi Ellen','Watts','1968-09-28','K'),
	('Billy','Howle','1989-09-09','E'),
	('Denis','O`Hare','1962-01-17','E'),
	('Charlie','McDowell','1983-07-10','E'),				-- WÝNDFALL YÖNETMEN VE SENARÝST
	('Jason','Segel','1980-01-18','E'),
	('Lily','Collins','1989-03-18','K'),
	('Jesse','Plemons','1988-04-02','E')
GO

INSERT INTO HangiFilmHangiEkipHangiGorev VALUES
	(1,3,1),
	(1,5,2),
	(1,1,3),
	(1,2,4),(1,2,5),(1,2,6),

	(2,3,7),
	(2,5,7),
	(2,1,8),
	(2,2,9),(2,2,10),

	(3,3,11),
	(3,5,12),
	(3,1,3),
	(3,2,13),(3,2,8),

	(4,3,14),
	(4,5,15),
	(4,1,16),
	(4,2,17),(4,2,18),

	(5,3,19),
	(5,5,19),
	(5,1,20),
	(5,2,21),(5,2,22),

	(6,3,23),
	(6,5,23),
	(6,1,24),
	(6,2,25),(6,2,26),

	(7,3,27),
	(7,5,28),
	(7,1,29),
	(7,2,30),(7,2,31),

	(8,3,32),
	(8,5,32),
	(8,1,33),
	(8,2,34),(8,2,35),

	(9,3,36),
	(9,5,37),
	(9,1,38),
	(9,2,39),(9,2,40),

	(10,3,41),
	(10,5,41),
	(10,1,42),
	(10,2,43),(10,2,44)
GO

INSERT INTO Seans VALUES
	('pazartesi','12:30',1),
	('pazartesi','17:30',2),
	('salý','12:30',3),
	('salý','17:30',4),
	('çarþamba','12:30',5),
	('çarþamba','17:30',6),
	('perþembe','12:30',7),
	('perþembe','17:30',8),
	('cuma','12:30',9),
	('cuma','17:30',10)
GO

INSERT INTO HangiSalonHangiSeans VALUES
	(1,1),(1,2),
	(1,3),(1,4),
	(1,5),(1,6),
	(1,7),(1,8),
	(1,9),(1,10),

	(2,1),(2,2),
	(2,3),(2,4),
	(2,5),(2,6),
	(2,7),(2,8),
	(2,9),(2,10),

	(3,1),(3,2),
	(3,3),(3,4),
	(3,5),(3,6),
	(3,7),(3,8),
	(3,9),(3,10),

	(4,1),(4,2),
	(4,3),(4,4),
	(4,5),(4,6),
	(4,7),(4,8),
	(4,9),(4,10),

	(5,1),(5,2),
	(5,3),(5,4),
	(5,5),(5,6),
	(5,7),(5,8),
	(5,9),(5,10),

	(6,1),(6,2),
	(6,3),(6,4),
	(6,5),(6,6),
	(6,7),(6,8),
	(6,9),(6,10),

	(7,1),(7,2),
	(7,3),(7,4),
	(7,5),(7,6),
	(7,7),(7,8),
	(7,9),(7,10),

	(8,1),(8,2),
	(8,3),(8,4),
	(8,5),(8,6),
	(8,7),(8,8),
	(8,9),(8,10),

	(9,1),(9,2),
	(9,3),(9,4),
	(9,5),(9,6),
	(9,7),(9,8),
	(9,9),(9,10),

	(10,1),(10,2),
	(10,3),(10,4),
	(10,5),(10,6),
	(10,7),(10,8),
	(10,9),(10,10),

	(11,1),(11,2),
	(11,3),(11,4),
	(11,5),(11,6),
	(11,7),(11,8),
	(11,9),(11,10),

	(12,1),(12,2),
	(12,3),(12,4),
	(12,5),(12,6),
	(12,7),(12,8),
	(12,9),(12,10),

	(13,1),(13,2),
	(13,3),(13,4),
	(13,5),(13,6),
	(13,7),(13,8),
	(13,9),(13,10)
GO

INSERT INTO Seyirci VALUES
	('kamilhan','karaismailoðlu','2000-01-01','E','kamilhan@gmail.com',1,1),
	('bedirhan','karaismailoðlu','2005-07-21','E','bedirhan@gmail.com',1,1),
	('dilara','karaismailoðlu','2004-07-17','K','dilara@gmail.com',1,1),
	('ibrahim','karaismailoðlu','1975-01-21','E','ibrahim@gmail.com',1,1),
	('reyhan','karaismailoðlu','1978-02-20','K','reyhan@gmail.com',1,1),
	('fatih hamza','özsoy','2000-08-02','E','fatih@gmail.com',1,1),
	('ömer faruk','öztürk','1998-09-16','E','ömer@gmail.com',1,1),
	('sefa','zor','1999-01-01','E','sefa@gmail.com',3,3),
	('emrah','çurku','1997-01-01','E','emrah@gmail.com',3,3),
	('mustafa','aktaþ','2000-01-01','E','mustafa@gmail.com',3,3)
GO

INSERT INTO Bilet VALUES
	(50,'2022-05-30','2022-04-25',1,1,1,1,1,1,1),
	(50,'2022-05-30','2022-04-25',1,1,1,1,2,1,2),
	(50,'2022-05-30','2022-04-25',1,1,1,1,3,1,3),
	(50,'2022-05-30','2022-04-25',1,1,1,1,4,1,4),
	(50,'2022-05-30','2022-04-25',1,1,1,1,5,1,5),
	(50,'2022-05-30','2022-04-25',1,1,1,1,6,1,6),
	(50,'2022-05-30','2022-04-25',1,1,1,1,7,1,7),

	(50,'2022-05-30','2022-04-25',1,1,1,6,210,3,8),
	(50,'2022-05-30','2022-04-25',1,1,1,6,211,3,9),
	(50,'2022-05-30','2022-04-25',1,1,1,6,212,3,10)
GO